[
  {
    "name": "Θεμελιώδεις γνώσεις  Πληροφορικής",
    "number": 1,
    "code": 500,
    "introduction": "Η κατανόηση των θεμελιωδών αρχών είναι αναγκαία για κάθε επιστήμη. Γι' αυτό είναι απαραίτητο ο φοιτητής να έχει κατανοήσει τα θεμελιώδη μαθήματα, ώστε να αποκτήσει μία καλή βάση γνώσης και να είναι σε θέση να κατανοήσει πιο δύσκολα προβλήματα στο μέλλον. Πιο συγκεκριμένα, κάθε πληροφορικός πρέπει να έχει μία καλή κατανόηση μαθηματικών, γλωσσών προγραμματισμού καθώς και θεωρίας αλγορίθμων.  Σημειώνεται ότι τα μαθήματα που θα παρουσιαστούν σε αυτή την ενότητα διδάσκονται σε όλες τις σχολές Πληροφορικής και είναι απαραίτητο να γίνουν κατανοητά τα μαθησιακά αποτελέσματα που προσφέρουν να γίνουν κατανοητά πριν εμβαθύνουμε σε πιο δύσκολα ζητήματα στον τομέα της επιστήμης της Πληροφορικής.",
    "courses": [
      {
        "name": "Μαθηματικά στην Πληροφορική",
        "code": 1801
      },
      {
        "name": "Αντικειμενοστρεφής Προγραμματισμός με Java/C#",
        "code": 1802
      },
      {
        "name": "Εισαγωγη  στη C/C++ και Python",
        "code": 1803
      },
      {
        "name": "Δομές Δεδομένων και Αλγόριθμοι",
        "code": 1804
      },
      {
        "name": "Μεταγλωττιστές",
        "code": 1805
      }
    ]
  },
  {
    "name": "Εισαγωγή στην ανάπτυξη εφαρμογών ",
    "number": 2,
    "code": 505,
    "introduction": "Η σύγχρονη αγορά εργασίας έχει ανάγκη από προγραμματιστές που είναι ικανοί να σχεδιάζουν και να υλοποιούν λογισμικό.  Η ανάπτυξη λογισμικού (Software Development) συνδυάζει ποικίλες μεθόδους που υπάρχουν στο τομέα της Πληροφορικής με σκοπό την δημιουργία ολοκληρωμένων εφαρμογών για την επίλυση επιχειρησιακών προβλημάτων. Τα μαθήματα που παρουσιάζονται σε αυτή την ενότητα παρέχουν στον φοιτητή γνώσεις ώστε να κατανοήσει σύγχρονες μεθόδους ανάπτυξης λογισμικού.",
    "courses": [
      {
        "name": "Τεχνολογία Λογισμικού",
        "code": 1901
      },
      {
        "name": "Σύγχρονα Θέματα Τεχνολογίας Λογισμικού - Λογισμικό για Κινητές Συσκευές",
        "code": 1902
      },
      {
        "name": "Τεχνολογίες Αναπτυξης Ηλεκτρονικών Παιχνιδιών",
        "code": 1903
      },
      {
        "name": "Αλληλεπίδραση ανθρώπου υπολογιστη",
        "code": 1904
      }
    ]
  },
  {
    "name": "Προηγμένες γνώσεις Πληροφορικής",
    "number": 3,
    "code": 510,
    "introduction": "Η Πληροφορική δεν περιορίζεται μόνο στην δημιουργία κώδικα. Πίσω από κάθε λειτουργικότητα υπάρχει ένα θεωρητικό υπόβαθρο το οποίο πρέπει να κατέχει κάποιος προτού ακόμη αρχίσει να μιλάει για δημιουργία προγραμμάτων. Προκειμένου να εμβαθύνουμε περισσότερο, πρέπει να έχουμε μία καλύτερη αντίληψη για πιο προηγμένα ζητήματα. Πολλές λειτουργίες που παρέχουν σύγχρονα συστήματα μπορεί να τις θεωρούμε δεδομένες, αλλά από πίσω κρύβουν ένα βαθύ θεωρητικό υπόβαθρο. Παραδείγματα αποτελούν η αποθήκευση και μετάδοση πολυμεσικού περιεχομένου, τα λειτουργικά συστήματα (Operating Systems) και άλλα. Επίσης η πληροφορική μπορεί άμεσα να συνδυαστεί με άλλους τομείς της επιστήμης, όπως την βιολογία (Βιοπληροφορική).",
    "courses": [
      {
        "name": "Συστήματα Πολυμέσων",
        "code": 2001
      },
      {
        "name": "Αναγνώριση Προτύπων",
        "code": 2002
      },
      {
        "name": "Κρυπτογραφία",
        "code": 2003
      },
      {
        "name": "Βιοπληροφορική Λειτουργικά Συστήματα",
        "code": 2004
      },
      {
        "name": "Λειτουργικά Συστήματα",
        "code": 2005
      }
    ]
  },
  {
    "name": "Εισαγωγή σε Ευφυή Συστήματα",
    "number": 4,
    "code": 520,
    "introduction": "Η ανάπτυξη συστημάτων με Ευφυία είναι ένας σύγχρονος και μεγάλος κλάδος της επιστήμης της Πληροφορικής. Υπάρχουν μαθήματα που εισάγουν τους φοιτητές με την επεξεργασία φυσικής γλώσσας και ανθρώπινης φωνής για τη δημιουργία Automatic Speech Recognition Systems καθώς επίσης Face Recognition Systems μέσω τεχνικών ανάλυσης εικόνας (computer vision).",
    "courses": [
      {
        "name": "Ανάλυση Εικόνας",
        "code": 2101
      },
      {
        "name": "Επεξεργασία Φυσικής Γλώσσας",
        "code": 2102
      },
      {
        "name": "Επεξεργασία Σημάτων Φωνής και Ήχου",
        "code": 2103
      }
    ]
  }
]