[
  {
    "name": "Συστήματα Πολυμέσων",
    "code": 1,
    "description": "Το μάθημα Συστήματα Πολυμέσων ασχολείται με την επιστημονική περιοχή στην οποία συναντώνται και γονιμοποιούνται πληθώρα επιστημονικών πεδίων, όπως η Επεξεργασία Σήματος, η Θεωρία Πληροφορίας και οι επικοινωνίες, με στόχο τη Δημιουργία, την Αποθήκευση/Συμπίεση και τη Διανομή του Πολυμεσικού Περιεχομένου. Σκοπός, επομένως, του παρόντος μαθήματος είναι να παρουσιάσει με ενιαίο τρόπο τις θεμελιώδεις έννοιες της πολυμεσικής επεξεργασίας, τα προβλήματα που καλείται να επιλύσει η σχεδίαση πολυμεσικών συστημάτων και τις σημαντικότερες τεχνικές ψηφιοποίησης, συμπίεσης και διανομής πολυμεσικού περιεχομένου.",
    "paragraphs": [
      {
        "text": "Όπως αναφέρθηκε παραπάνω, το μάθημα Συστήματα Πολυμέσων συνδυάζει γνώσεις από πολλά επιστημονικά πεδία της Πληροφορικής με σκοπό την επεξεργασία Πολυμεσικού Περιεχομένου, δηλαδή εικόνων, βίντεο και ήχου. Πρόκειται για ένα σύνθετο ζήτημα που απαιτεί αρκετές γνώσεις για να γίνει κατανοητό σε βάθος, αλλά δε παύει να είναι απολύτως αναγκαίο για κάθε επιστήμονα Πληροφορικής.",
        "imageName": "multi1.png"
      },
      {
        "text": "Ο σημερινός ψηφιακός κόσμος έχει σαφώς πολύ μεγάλη επιρροή στη ζωή των ανθρώπων και η αλήθεια είναι ότι χωρίς αλγορίθμους συστημάτων πολυμέσων ο ψηφιακός κόσμος θα ήταν αδύνατο να υπάρχει. Χαρακτηριστικό παράδειγμα αποτελεί η πράξη της συμπίεσης. Από την πρώτη φορά που άρχισε ο άνθρωπος να αποθηκεύει ή να μεταδίδει ψηφιακή πληροφορία (π.χ. βιντεοκασέτες, ασπρόμαυρη τηλεόραση) υπήρχε η ανάγκη της συμπίεσης. Πολύ απλά δεν είναι δυνατό να αποθηκευθεί ή να μεταδοθεί ένα βίντεο ή μια εικόνα αν πρώτα δεν συμπιεστεί, γιατί πολύ απλά θα χρειαζόμασταν τεράστιους αποθηκευτικούς χώρους και πολύ ακριβότερα συστήματα μετάδοσης.",
        "imageName": "multi2.png"
      },
      {
        "text": "Το ίδιο ισχύει και σήμερα με τα μέσα κοινωνικής δικτύωσης (Youtube, Instagram, Facebook και άλλα), όπου συνηθίζεται να αναρτώνται εικόνες και βίντεο πολύ υψηλής ποιότητας. Χάρις στους αλγορίθμους συστημάτων πολυμέσων οι εικόνες και τα βίντεο μεταδίδονται και εμφανίζονται εύκολα και γρήγορα μέχρι και από κινητές συσκευές. ",
        "imageName": "multi3.png"
      },
      {
        "text": "Συμπεραίνουμε λοιπόν πως η χρησιμότητα του μαθήματος αυτού είναι και θα εξακολουθεί να είναι μεγάλη για αρκετά χρόνια. Αναμφισβήτητα τα Συστήματα Πολυμέσων αποτελούν και έναν τομέα εξειδίκευσης, αλλά εξακολουθούν να είναι πολύ χρήσιμα για πολλές κατευθύνσεις της Πληροφορικής, καθώς δίνει λύσεις σε προβλήματα που εμφανίζονται πολλές φορές στους σύγχρονους υπολογιστές.",
        "imageName": ""
      }
    ],
    "goals": [
      {
        "text": "Εξοικείωση με προχωρημένες γνώσεις σε αλγορίθμους, τεχνικές και μεθοδολογίες δημιουργίας, συμπίεσης και δικτύωσης ψηφιακού περιεχομένου, όπως συμπίεσης χωρίς/με απώλειες εικόνας, ήχου, βίντεο, γραφικών (JPEG, JPEG-2000, MPEG-4), ασύρματης δικτύωσης (π.χ., Bluetooth) και ψηφιακής διαχείρισης δικαιωμάτων (π.χ. λύσεις DRM στη μουσική βιομηχανία)."
      },
      {
        "text": "Ικανότητα συνδυασμού γνώσεων επεξεργασίας σήματος, θεωρίας χρώματος, ψυχοακουστικής, θεωρίας της πληροφορίας, συμπίεσης και δικτύωσης για τη δημιουργία και λειτουργία συστημάτων πολυμέσων."
      },
      {
        "text": "Ικανότητα επίλυσης προβλημάτων πραγματικών δεδομένων, στα οποία απαιτείται η σχεδίαση/ανάπτυξη/υλοποίηση συστημάτων επεξεργασίας/ανάλυσης πολυμεσικού περιεχομένου, επιλογή κατάλληλων αλγορίθμων και συγκριτική μελέτη των επιδόσεων εναλλακτικών λύσεων."
      },
      {
        "text": "Ικανότητα διάκρισης των συναφών της πολυμεσικής επεξεργασίας εννοιών, στα συγγενή επιστημονικά πεδία της Επεξεργασίας Σήματος, της Θεωρίας της Πληροφορίας , της Συμπίεσης Δεδομένων και της Δικτύωσης Δεδομένων."
      }
    ],
    "extras": [
      {
        "title": "Video compression in C++",
        "url": "https://github.com/JawThrow/ICSPCodec"
      },
      {
        "title": "Image Compression in Matlab",
        "url": "https://www.mathworks.com/help/images/discrete-cosine-transform.html"
      },
      {
        "title": "Simple Audio Compression With Python",
        "url": "https://medium.com/@jmpion/simple-audio-compression-with-python-70bdd7535b0a"
      }
    ]
  },
  {
    "name": "Αναγνώριση Προτύπων",
    "code": 2,
    "description": "Η Αναγνώριση Προτύπων (Pattern Recognition) είναι ένα επιστημονικό πεδίο που ανήκει στον ευρύτερο τομέα της Τεχνητής Νοημοσύνης και έχει στόχο την ανάπτυξη αλγορίθμων για την αυτοματοποιημένη ταξινόμηση και κατηγοριοποίηση δεδομένων. Χάρις αυτό το μάθημα είναι δυνατή η ανάπτυξη ευφυής λογισμικού για την επίλυση πραγματικών προβλημάτων.",
    "paragraphs": [
      {
        "text": "Σήμερα, αλγόριθμοι Αναγνώρισης Προτύπων εφαρμόζονται σε αρκετές επιστήμες, όπως για παράδειγμα στην ιατρική (βιοϊατρική τεχνολογία, ανάλυση δεδομένων DNA και άλλες εφαρμογές της βιοπληροφορικής), ή σε άλλα πεδία της Πληροφορικής και της επιστήμης ηλεκτρονικού μηχανικού, όπως η μηχανική όραση και η ρομποτική. Η ίδια η αναγνώριση προτύπων επικαλύπτεται σημαντικά με συγγενή, επιμέρους πεδία της Τεχνητής Νοημοσύνης όπως η Μηχανική Μάθηση και η Εξόρυξη Δεδομένων (Data Mining). ",
        "imageName": "patternrec1.png"
      },
      {
        "text": "Η αναγνώριση προτύπων έχει ποικίλες εφαρμογές, όπως η επεξεργασία εικόνων, η αναγνώριση ομιλίας και δακτυλικών αποτυπωμάτων, η ερμηνεία αεροφωτογραφιών, η οπτική αναγνώριση χαρακτήρων σε σαρωμένα έγγραφα, όπως συμβόλαια και φωτογραφίες, ακόμη και η ιατρική απεικόνιση και διάγνωση. ",
        "imageName": "patternrec2.png"
      },
      {
        "text": "Τέλος, η αναγνώριση προτύπων είναι ένας δύσκολος αλλά συναρπαστικός και ταχέως αναπτυσσόμενος επιστημονικός τομέας, ο οποίος είναι και θα εξακολουθεί να είναι σημαντικός για πολλά χρόνια.",
        "imageName": "patternrec3.png"
      }
    ],
    "goals": [
      {
        "text": "Συνδυασμός γνώσεων πιθανοτήτων, στατιστικής, γραμμικής άλγεβρας για βελτιστοποίηση και δημιουργία αλγορίθμων αναγνώρισης προτύπων."
      },
      {
        "text": "Ικανότητα ανάλυσης προβλήματων πραγματικών δεδομένων (ανοικτής πρόσβασης), στα οποία απαιτείται η σχεδίαση/ανάπτυξη/υλοποίηση συστημάτων ταξινόμησης αντικειμένων."
      },
      {
        "text": "Διάκριση των συναφή εννοιών της αναγνώρισης προτύπων, στα συγγενή επιστημονικά πεδία της Μηχανικής Μάθησης, της Ανάλυσης Δεδομένων και της Τεχνητής Νοημοσύνης."
      },
      {
        "text": "Εξοικείωση με περιβάλλον ανάπτυξης λογισμικού Python/MATLAB/GNU Octave για την υλοποίηση αλγορίθμων, τεχνικών και μεθόδων ταξινόμησης αντικειμένων."
      }
    ],
    "extras": [
      {
        "title": "Linear Regression in Python",
        "url": "https://realpython.com/linear-regression-in-python/"
      },
      {
        "title": "Python AI: How to Build a Neural Network",
        "url": "https://realpython.com/python-ai-neural-network/"
      },
      {
        "title": "Naive Bayes Classification",
        "url": "https://www.datacamp.com/tutorial/naive-bayes-scikit-learn"
      }
    ]
  },
  {
    "name": "Κρυπτογραφία",
    "code": 3,
    "description": "Η σημασία της Κρυπτογραφίας είναι τεράστια στους τομείς της ασφάλειας υπολογιστικών συστημάτων και των τηλεπικοινωνιών. Ο κύριος στόχος της είναι να παρέχει μηχανισμούς ώστε 2 ή περισσότερα άκρα επικοινωνίας (π.χ. άνθρωποι, προγράμματα υπολογιστών κλπ.) να ανταλλάξουν μηνύματα, χωρίς κανένας τρίτος να είναι ικανός να διαβάζει την περιεχόμενη πληροφορία εκτός από τα δύο κύρια άκρα. Χωρίς την Κρυπτογραφία δεν θα ήταν δυνατόν να γίνονται online συναλλαγές ή αποθήκευση και μετάδοση ευαίσθητων δεδομένων.",
    "paragraphs": [
      {
        "text": "Το μάθημα της κρυπτογραφίας ασχολείται με τη μελέτη και την εφαρμογή τεχνικών που σχετίζονται με την προστασία της πληροφορίας από ανεπιθύμητη πρόσβαση ή αλλοίωση. Η κρυπτογραφία ασχολείται με την επιστήμη των μυστικών κωδικών, των αλγορίθμων κρυπτογράφησης και αποκρυπτογράφησης, καθώς και των πρωτοκόλλων ασφαλείας.",
        "imageName": "cp1.png"
      },
      {
        "text": "Το μάθημα αναλύει τις βασικές αρχές της κρυπτογραφίας και τις διάφορες μεθόδους κρυπτογράφησης, συμπεριλαμβανομένων των συμμετρικών και ασύμμετρων κρυπτογραφικών αλγορίθμων. Οι συμμετρικοί αλγόριθμοι χρησιμοποιούν έναν κοινό κλειδί για την κρυπτογράφηση και αποκρυπτογράφηση των δεδομένων, ενώ οι ασύμμετροι αλγόριθμοι χρησιμοποιούν ζεύγη κλειδιών, ένα δημόσιο κλειδί για την κρυπτογράφηση και ένα ιδιωτικό κλειδί για την αποκρυπτογράφηση.",
        "imageName": "cp2.png"
      },
      {
        "text": "Επιπλέον, το μάθημα εξετάζει θέματα όπως η ασφάλεια πρωτοκόλλων επικοινωνίας, η ψηφιακή υπογραφή, οι αλγόριθμοι κατακερματισμού (hashing) και η ανίχνευση αλλοίωσης δεδομένων. Οι στόχοι της κρυπτογραφίας περιλαμβάνουν τη διατήρηση της εχεμύθειας, της ακεραιότητας και της αυθεντικότητας των δεδομένων.",
        "imageName": ""
      },
      {
        "text": "Το μάθημα της κρυπτογραφίας είναι σημαντικό για την κατανόηση των απαραίτητων τεχνικών για την προστασία της πληροφορίας σε διάφορους τομείς, όπως οι τραπεζικές συναλλαγές, οι ηλεκτρονικές επικοινωνίες και οι δίκτυα υπολογιστών. Επιπλέον, η κρυπτογραφία αποτελεί σημαντικό εργαλείο για την προστασία της ιδιωτικότητας και την ασφάλεια των δεδομένων στη σύγχρονη ψηφιακή κοινωνία.",
        "imageName": "cp3.jpg"
      }
    ],
    "goals": [
      {
        "text": "Εξοικείωση με τα σύγχρονα είδη αλγόριθμων κρυπτογράφησης."
      },
      {
        "text": "Δυνατότητα αξιολόγησης της ασφάλειας που προσφέρει ένας αλγόριθμος κρυπτογράφησης."
      },
      {
        "text": "Ικανότητα εντοπισμού και αξιολόγησης πιθανών κενών ασφάλειας ενός πρωτοκόλλου."
      },
      {
        "text": "Ικανότητα υλοποίησης αλγόριθμου κρυπτογράφησης."
      }
    ],
    "extras": [
      {
        "title": "Cryptohack",
        "url": "https://cryptohack.org/"
      },
      {
        "title": "Root me - challenge your hacking skills",
        "url": "https://www.root-me.org/?lang=en"
      },
      {
        "title": "Tryhackme.com - learn cyber security",
        "url": "https://tryhackme.com/"
      }
    ]
  },
  {
    "name": "Βιοπληροφορική",
    "code": 4,
    "description": "Η Βιοπληροφορική είναι πεδίο σύγκλισης διαφορετικών επιστημονικών περιοχών, που έχουν στόχο την ανάπτυξη αλγορίθμων και στατιστικών μεθόδων για την ανάλυση και περαιτέρω κατανόηση μεγάλων συλλογών διαφορετικών τύπων βιολογικών δεδομένων, όπως ακολουθιών νουκλεοτιδίων, αμινοξέων και πρωτεϊνικών δομών, καθώς και της εξελικτικής σχέσης μεταξύ οργανισμών. Κατά τη διάρκεια της τελευταίας δεκαετίας η βιοπληροφορική σχεδίασε και υλοποίησε εργαλεία που επιτρέπουν την πρόσβαση και διαχείριση διαφόρων ειδών πληροφορίας, με κύρια δραστηριότητα τη μελέτη των γονιδιακών ακολουθιών με στόχο την κατανόηση της λειτουργίας του κυττάρου.",
    "paragraphs": [
      {
        "text": "Γενικότερος στόχος του μαθήματος της Βιοπληροφορικής είναι να παρέχει βασικές γνώσεις στα προαναφερθέντα ζητήματα, για φοιτητές που επιθυμούν να ασχοληθούν περισσότερα εντατικά με τα ζητήματα αυτά στη μετέπειτα σταδιοδρομία τους. ",
        "imageName": "bio1.png"
      },
      {
        "text": "Το μάθημα αυτό συνδυάζει γνώσεις από το πεδίο των Αλγορίθμων, των Δομών Δεδομένων ακόμη και της Αναγνώρισης Προτύπων (για παράδειγμα clustering νουκλεοτιδίων σε κλάσεις). Η Βιοπληροφορική είναι τόσο θεωριτικό, όσο και πρακτικό μάθημα και επιτρέπει την άμεση σύνδεση της Πληροφορικής με τον τομέα της Βιολογίας. Μάλιστα δεν χρειάζονται πάντα πολλές γνώσεις Βιολογίας για την επίλυση προβλημάτων Βιοπληροφορικής το οποίο σημαίνει πως ένας Πληροφορικός μπορεί να εξειδικευτεί μόνο με το προγραμματιστικό κομματικό και όχι τόσο με το θεωρητικό.",
        "imageName": "bio2.png"
      },
      {
        "text": "Φυσικά αν κάποιος εξειδικευτεί μπορεί να εμβαθύνει πολύ περισσότερο στον τομέα της Βιοπληροφορικής και έτσι να αποκτήσει ένα μεγάλο εύρος γνώσεων επιστημών.",
        "imageName": "bio3.png"
      }
    ],
    "goals": [
      {
        "text": "Εξοικείωση με τους τύπους των μοριακών βάσεων δεδομένων και τους κύριους περιηγητές γονιδιωμάτων."
      },
      {
        "text": "Ικανότητα χρήσης διάφορων διαδικτυακών πηγών πληροφοριών για μεμονωμένα γονίδια και για μεγάλα σύνολα γονιδίων/πρωτεϊνών, με έμφαση στις πηγές που είναι προσβάσιμες μέσω της πύλης NCBI."
      },
      {
        "text": "Εξοικείωση με κρυφά Μαρκοβιανά μοντέλα και αλγορίθμους πολλαπλής στοίχισης αλληλουχειών."
      },
      {
        "text": "Δυνατότητα υλοποίησης αλγορίθμων βιοπληροφορικής σε περιβάλλον ανάπτυξης Python/MATLAB/GNU Octave."
      }
    ],
    "extras": [
      {
        "title": "Biopython",
        "url": "https://biopython.org/"
      },
      {
        "title": "UCSF ChimeraX",
        "url": "https://www.rbvi.ucsf.edu/chimerax/"
      },
      {
        "title": "MEGA",
        "url": "https://www.megasoftware.net/"
      }
    ]
  }
]