[
  {
    "name": "Ανάλυση Εικόνας",
    "code": 1,
    "description": "Η Ανάλυση Εικόνας στοχεύει στην ανάπτυξη αλγορίθμων που επιτρέπουν σε μηχανές να κατανοούν τον οπτικό κόσμο. Με αυτό το τρόπο μπορούν να υλοποιηθούν πιο περίπλοκα συστήματα όπως αυτοοδηγούμενα αυτοκίνητα, συστήματα αναγνώρισης προσώπου και άλλα. Η Ανάλυση Εικόνας εξετάζει θέματα Υπολογιστικής Όρασης (Computer Vision) και Επεξεργασίας Εικόνας (Image Processing).",
    "paragraphs": [
      {
        "text": "Όπως αναφέρθηκε και στην εισαγωγή, οι δύο βασικές θεματικές ενότητες του μαθήματος της Ανάλυσης Εικόνας είναι η Υπολογιστική Όραση (Computer Vision) και η Επεξεργασία Εικόνας (Image Processing). Μπορεί οι όροι αυτοί να φαίνεται πως αφορούν τα ίδια ζητήματα, αλλά στην πραγματικότητα δεν είναι ισοδύναμοι. Πιο συγκεκριμένα, η Επεξεργασία Εικόνας, ή αλλιώς Ψηφιακή Επεξεργασία Εικόνας, είναι η διαδικασία μετατροπής μίας εικόνας σε ψηφιακή μορφή και η επεξεργασία της μέσω κάποιου αλγορίθμου για την άντληση δεδομένων. Κάθε εικόνα αντιμετωπίζεται σαν ένα δισδιάστατο σήμα στο οποίο εφαρμόζονται τεχνικές επεξεργασίας σήματος. Συμπεραίνουμε λοιπόν ότι απαιτείται ένα ικανοποιητικό υπόβαθρο Ψηφιακής Επεξεργασίας Σήματος για την κατανόηση της Επεξεργασία Εικόνας.",
        "imageName": ""
      },
      {
        "text": "Υπάρχουν διάφοροι τομείς εφαρμογών όπου χρησιμοποιείται η επεξεργασία εικόνας. Μία από τις πιο συνηθισμένες περιπτώσεις χρήσης είναι η βελτίωση εικόνας, δηλαδή, όπως ορίσαμε η επεξεργασία εικόνας για να βελτιώσουμε την ποιότητα της εικόνας ώστε να αποκτήσουμε περισσότερες πληροφορίες γι' αυτήν. Στην διπλανή εικόνα παρουσιάζεται μια από τις τεχνικές βελτίωσης εικόνας, το ισοσταθμισμένο ιστόγραμμα, το οποίο αναμορφώνει την εικόνα για να δούμε περισσότερες λεπτομέρειες.",
        "imageName": "imageAnalysis1.png"
      },
      {
        "text": "Ένας άλλος όρος που αναφέρθηκε είναι η Υπολογιστική Όραση και αποτελεί ένα ριζικά διαφορετικό αντικείμενο σε σχέση με την Επεξεργασία Εικόνας. Στην Υπολογιστική Όραση μια εικόνα ή ένα βίντεο χρησιμοποιείται ως είσοδος, αλλά το ίδιο το αρχείο δεν τροποποιείται με κανέναν τρόπο κατά τη διάρκεια αυτής της διαδικασίας. Ο στόχος είναι να βγάλουμε νόημα από την εικόνα και από αυτό που απεικονίζει. Παρόλο που ορισμένοι από τους αλγόριθμους Επεξεργασίας Εικόνας μπορεί να χρησιμοποιηθούν κατά τη διαδικασία επίλυσης προβλημάτων της Υπολογιστικής Όρασης, η επεξεργασία των εικόνων δεν αποτελεί το επίκεντρο της εφαρμογής. Στην πραγματικότητα, οι διαδικασίες Επεξεργασίας Εικόνας αξιοποιούνται προκειμένου να επιτευχθούν οι ανάγκες της Υπολογιστικής Όρασης. Πολλές φορές αξιοποιούνται και αλγόριθμοι Αναγνώρισης Προτύπων για να αναγνωρίσουν πρότυπα (patterns) που υπάρχουν στην πληροφορία που εξάγουν οι αλγόριθμοι Επεξεργασίας Εικόνας.",
        "imageName": ""
      },
      {
        "text": "Ένα κλασσικό πρόβλημα που λύνει η Υπολογιστική Όραση είναι αυτό της ταξινόμησης εικόνων (Image classification), όπου σχεδιάζεται ένας αλγόριθμος που αναγνωρίζει σε ποια κατηγορία ανήκει μια είκανα (π.χ. σκύλος ή γάτα). Επίσης ένα άλλο πρόβλημα στο τομέα αυτό είναι η ανίχνευση αντικειμένων (Object detection) όπου γίνεται αναγνώριση των διαφόρων μεμονωμένων αντικειμένων που υπάρχουν σε μία εικόνα. Γενικά η Υπολογιστική Όραση ανήκει στο ευρύτερο πεδίο της Τεχνητής Νοημοσύνης, ενώ η Επεξεργασία Εικόνας είναι μία υποκατηγορία της Ψηφιακής Επεξεργασίας Σήματος.",
        "imageName": "imageAnalysis2.jpg"
      }
    ],
    "goals": [
      {
        "text": "Κατανόηση βασικών αλγορίθμων Επεξεργασίας Εικόνας και υλοποίησή τους σε μία γλώσσα προγραμματισμού."
      },
      {
        "text": "Χρήση αλγορίθμων Επεξεργασίας Εικόνας για επίλυση προβλημάτων."
      },
      {
        "text": "Συνδυασμός γνώσεων από την αναγνώριση προτύπων για την επίλυση προβλημάτων Υπολογιστικής Όρασης."
      }
    ]
  },
  {
    "name": "Επεξεργασία Φυσικής Γλώσσας",
    "code": 2,
    "description": "Η επεξεργασία φυσικής γλώσσας (Natural language processing - NLP) είναι ένα διεπιστημονικό υποπεδίο της γλωσσολογίας, της επιστήμης των υπολογιστών και της τεχνητής νοημοσύνης που ασχολείται με τις αλληλεπιδράσεις μεταξύ των υπολογιστών και της ανθρώπινης γλώσσας. Στόχος της επεξεργασίας φυσικής γλώσσας είναι ένας υπολογιστής να είναι ικανός να κατανοεί το περιεχόμενο κειμένων με τον ίδιο τρόπο που θα τα κατανοούσε ένας άνθρωπος.",
    "paragraphs": [
      {
        "text": "Η επεξεργασία φυσικής γλώσσας αποτελεί έναν τομέα της Πληροφορικής που σημειώνει σημαντική πρόοδο τα τελευταία χρόνια και είναι σημαντικό στη μελέτη να δίνεται έμφαση στις τελευταίες ανακαλύψεις.",
        "imageName": "nlp1.png"
      },
      {
        "text": "Η επεξεργασία φυσικής γλώσσας προσεγγίζει το πρόβλημα της αναγνώρισης κειμένου αξιοποιώντας γνώσεις από το μάθημα των Μεταγλωττιστών. Συγκεκριμένα χρησιμοποιείται ο λεκτικός και ο συντακτικός αναλυτής με μόνη διαφορά ότι προορίζονται για μία ανθρώπινη γλώσσα και όχι μία γλώσσα προγραμματισμού."
      },
      {
        "text": "Ωστόσο αυτή δεν είναι η μόνη προσέγγιση που υπάρχει στην επεξεργασία φυσικής γλώσσας. Το 2013 δημοσιεύτηκε ένας νέος τρόπος αναγνώρισης κειμένου που ονομάζεται word2vec. Η μέθοδος αυτή αξιοποιεί μηχανική μάθηση και αλγορίθμους αναγνώρισης προτύπων.",
        "imageName": "np2.png"
      },
      {
        "text": "Συμπεραίνουμε πως το μάθημα αυτό έχει μεγάλη ύλη η οποία μάλιστα συνεχώς εξελίσσεται και έχει σημειώσει σημαντική πρόοδο τα τελευταία χρόνια. Γνωστές εφαρμογές στις οποίες μπορεί να χρησιμοποιηθεί η επεξεργασία φυσικής γλώσσας είναι: Sentiment Analysis (Ανάλυση Συναισθήματος), Chatbots και Virtual Assistants, Αυτόματη μετάφραση, Αυτόματη διόρθωση κειμένων (Auto-Correct) και άλλα."
      }
    ],
    "goals": [
      {
        "text": "Εξοικείωση με τη δομή ενός συστήματος επεξεργασίας φυσικής γλώσσας."
      },
      {
        "text": "Κατανόηση εννοιών της παραγωγής λόγου, της ανάλυσης λόγου και της αυτόματης μετάφρασης."
      },
      {
        "text": "Ανάπτυξη αλγορίθμων για λεκτική και συντακτική ανάλυση, εξαγωγή γνώσης, παραγωγή λόγου."
      },
      {
        "text": "Εξοικείωση με πιο μοντέρνες τεχνικές επεξεργασίας φυσικής γλώσσας."
      }
    ]
  },
  {
    "name": "Επεξεργασία Σημάτων Φωνής και Ήχου",
    "code": 3,
    "description": "Η επεξεργασία σήματος ομιλίας είναι ένας δυναμικός και συνεχώς αναπτυσσόμενος τομέας για περισσότερα από 70 χρόνια. Τα πρώτα συστήματα επεξεργασίας ομιλίας ήταν αναλογικά συστήματα και ένα από τα πρώτα είναι τηλέφωνο που φτιάχτηκε από τον Γκράχαμ Μπελ. Πλέον χάρις τη σημαντική πρόοδο της Ψηφιακής Επεξεργασίας Σημάτων, Αναγνώρισης Προτύπων και άλλων κλάδων, η επεξεργασία σήματος ομιλίας έρχεται σε θέση να υλοποιεί ακόμη πιο περίπλοκα και εντυπωσιακά συστήματα σύνθεσης και αναγνώρισης ανθρώπινης φωνής.",
    "paragraphs": [
      {
        "text": "Το μάθημα κάνει μία εισαγωγή στις βασικές έννοιες και αλγορίθμους επεξεργασίας φωνής και ήχου, με ιδιαίτερη έμφαση στην ανθρώπινη φωνή, όπως και γενικότερων ακουστικών σημάτων, με έμφαση σε σήματα φωνής. ",
        "imageName": "sound1.png"
      },
      {
        "text": "Το μάθημα προσφέρει επιπλέον εξειδίκευση ως συνέχεια των μαθημάτων της Ψηφιακής Επεξεργασίας Σημάτων (Digital Signal Processing - DSP) και Αναγνώρισης Προτύπων, επιτρέποντας περισσότερη εμβάθυνση στη μελέτη των συγκεκριμένων σημάτων (φωνής και ήχου). Σημειώνεται πως το μάθημα μπορεί να συνδυαστεί και το μάθημα της Επεξεργασίας Φυσικής Γλώσσας για τη δημιουργία καλύτερων Automatic Speech Recognition Systems.",
        "imageName": "sound2.png"
      },
      {
        "text": "Τέλος, αξίζει να σημειωθεί πως η σύγχρονη επεξεργασία σήματος ομιλίας συνδυάζεται και με τελευταίες δημοσιεύσεις από τον τομέα της Αναγνώρισης Προτύπων, όπως τα Recurrent Neural Networks. Γενικά η επεξεργασία φωνής είναι ένας μεγάλος τομέας ο οποίος συνεχώς εξελίσσεται και αυτό συνεπάγεται ότι αποτελεί αναμφισβήτητα έναν τομέα στον οποίο μπορεί ένας επιστήμονας να εξειδικευτεί.",
        "imageName": "sound3.jpg"
      }
    ],
    "goals": [
      {
        "text": "Κατανόηση της διαδικασίας της παραγωγής και αντίληψης της ανθρώπινης φωνής."
      },
      {
        "text": "Εισαγωγή σε σύγχρονα συστήματα Αναγνώρισης Προτύπων."
      },
      {
        "text": "Εξοικείωση με τους βασικούς αλγόριθμους για αναγνώριση και σύνθεση φωνής."
      },
      {
        "text": "Χρήση του προγραμματιστικού Περιβάλλοντος Matlab και Python για υλοποίηση συστημάτων επεξεργασίας ήχου."
      }
    ]
  }
]