[
  {
    "name": "Μαθηματικά στην Πληροφορική",
    "code": 1801,
    "description": "1111111111"
  },
  {
    "name": "Αντικειμενοστρεφής Προγραμματισμός με Java/C#",
    "code": 1802,
    "description": "Ο αντικειμενοστραφής προγραμματισμός (Object Oriented Programming - OPP) είναι τόσο θεμελιώδες μέρος της ανάπτυξης λογισμικού που είναι δύσκολο να θυμηθούμε μια εποχή που οι άνθρωποι χρησιμοποιούσαν οποιαδήποτε άλλη προσέγγιση. Αυτές τις μέρες, η μεγαλύτερη ανάπτυξη λογισμικού εκτελείται με χρήση OOP. Χάρη στην ευρεία χρήση γλωσσών όπως η Java και η C#, η δημιουργία παραθυρικών και web εφαρμογών έγινε πιο εύκολη και γρήγορη. Αυτό ταυτόχρονα σημαίνει πως ένας προγραμματιστής τις περισσότερες φορές είναι αδύνατο να δημιουργήσει μία εφαρμογή αν δεν γνωρίζει αντικειμενοστραφή προγραμματισμό.",
    "paragraphs": [
      {
        "text": "Αντικείμενο του μαθήματος είναι η εισαγωγή στον αντικειμενοστρεφή προγραμματισμό με πλήρη ανάλυση της γλώσσας προγραμματισμού JAVA και της C#."
      },
      {
        "text": "Συγκεκριμένα, οι φοιτητές στα πρώτα μαθήματα εξοικιώνονται με τις βασικές δομές δεδομένων που υπάρχουν στις γλώσσες αυτές, την κληρονομικότητα, τον πολυμορφισμό, ενθυλάκωση, ειδικές κλάσεις, εξαιρέσεις, ειδικά θέματα, βιβλιοθήκες, διαπροσωπίες, προσπέλαση αρχείων, access modifiers, non-access modifiers."
      },
      {
        "text": "Σε επόμενα μαθήματα οι φοιτήτες εξοικιώνονται με IDE (Integraded Development Envriment) για τη δημιουργία παραθυρικών και web εφαρμογών μέσω Java και C#."
      }
    ],
    "goals": [
      {
        "text": "Εξοικείωση με τις βασικές αρχές που διέπουν τον αντικειμενοστρεφή προγραμματισμό."
      },
      {
        "text": "Ικανότητα υλοποίησης αντικειμενοστρεφών προγραμμάτων."
      },
      {
        "text": "Κατανόηση και χρήση τάξεων (classes) και διεπαφών (interfaces) στη Java και στη C#."
      },
      {
        "text": "Ικανότητα σχεδίασης και ανάπτυξης λογισμικού για επίλυση βασικών προβλημάτων."
      },
      {
        "text": "Εξοικείωση με κατάλληλα εργαλεία ανάπτυξης εφαρμογών με Java και C#."
      }
    ]
  },
  {
    "name": "Εισαγωγη  στη C/C++ και Python",
    "code": 1803,
    "description": "33333333333"
  },
  {
    "name": "Δομές Δεδομένων και Αλγόριθμοι",
    "code": 1804,
    "description": "Τα μαθήματα 'Δομές Δεδομένων' και 'Αλγορίθμοι' αποτελούν δύο από τα πιο θεμειώδη μαθήματα στον τομέα της Πληροφορικής και είναι απαραίτητα για την κατανόηση και τη σύνθεση κώδικα ανεξαρτήτως της γλώσσας προγραμματισμού. Γι' αυτό το λόγο πρέπει ο φοιτητής να έχει μία καλή κατανόηση αυτών των μαθημάτων αν θέλει να βελτιώσει την ικανότητα επίλυσης προβλημάτων.",
    "paragraphs": [
      {
        "text": "Στις 'Δομές Δεδομένων' το αντικείμενο του μαθήματος είναι η μελέτη των βασικών δομών δεδομένων που χρησιμοποιούνται στην ανάπτυξη αλγορίθμων . Έμφαση δίνεται στο χρόνο εκτέλεσης των βασικών λειτουργιών των δομών δεδομένων και στον αναλυτικό προσδιορισμό του πλήθους των βασικών εντολών που απαιτούνται για την ολοκλήρωσή τους. Επίσης, τεκμηριώνεται αναλυτικά και ο χώρος που απαιτεί κάθε δομή δεδομένων."
      },
      {
        "text": "Το αντικείμενο του μαθήματος 'Αλγορίθμοι' είναι η μελέτη τεχνικών για την επίλυση βασικών υπολογιστικών προβλημάτων και η παρουσίασή τους χωρίς αναφορά σε συγκεκριμένη γλώσσα προγραμματισμού. Τα προβλήματα που μελετούνται είναι κεντρικά στην επιστήμη της Πληροφορικής και ο σχεδιασμός αποδοτικών τεχνικών επίλυσης για αυτά τα συγκεκριμένα προβλήματα συντελεί στη γρήγορη επίλυση ενός πολύ μεγάλου αριθμού άλλων υπολογιστικών προβλημάτων που ανακύπτουν στα διάφορα πεδία εφαρμογών της Πληροφορικής. Στη παρουσίαση των σχετικών αλγορίθμων, έμφαση δίνεται στο χρόνο εκτέλεσης τους και σε κάθε περίπτωση αποδεικνύεται μαθηματικά το πλήθος των βασικών εντολών που απαιτούνται για την ολοκλήρωσή τους. Επίσης, τεκμηριώνεται αναλυτικά και η ποιότητα της λύσης που προσφέρει μία αλγοριθμική τεχνική στις περιπτώσεις που η επίτευξη της βέλτιστης λύσης είναι πολύ χρονοβόρα διαδικασία."
      },
      {
        "text": "Μεταξύ άλλων παρουσιάζονται αλγόριθμοι για προβλήματα ταξινόμησης, αναζήτησης, για προβλήματα γραφημάτων όπως διατρέξεις, συνεκτικές συνιστώσες, τοπολογική διάταξη, ελάχιστα γεννητικά δένδρα και συντομότερες διαδρομές. Επίσης, παρουσιάζονται αλγόριθμοι για βασικούς αριθμητικούς υπολογισμούς (πολλαπλασιασμός πινάκων, υπολογισμός τιμής πολυωνύμου, γρήγορος μετασχηματισμός Fourier)."
      }
    ],
    "goals": [
      {
        "text": "Εφαρμόζουν εύστοχα (σκεπτόμενοι αναλυτικά και κριτικά) τις κατάλληλες δομές δεδομένων για την επίλυση υπολογιστικών προβλημάτων που προκύπτουν στα διάφορα πεδία εφαρμογών."
      },
      {
        "text": "Αποτιμούν τόσο αναλυτικά όσο και πειραματικά το χρόνο εκτέλεσης των βασικών λειτουργιών μίας δομής δεδομένων."
      },
      {
        "text": "Να κατανοούν τη εγγενή δυσκολία ενός αλγοριθμικού προβλήματος."
      },
      {
        "text": "Να διακρίνουν το αλγοριθμικό πρόβλημα στα συστατικά του μέρη."
      },
      {
        "text": "Να εκτιμούν τόσο αναλυτικά όσο και πειραματικά την ποιότητα λύσης ενός αλγορίθμου."
      },
      {
        "text": "Να προσδιορίζουν αναλυτικά την πολυπλοκότητα χώρου και χρόνου των αλγοριθμικών τεχνικών."
      }
    ]
  },
  {
    "name": "Μεταγλωττιστές",
    "code": 1805,
    "description": "",
    "paragraphs": [
      {
        "text": "Το μάθημα ασχολείται με τη Θεωρία των Γλωσσών, την κατασκευή αυτομάτων αναγνώρισης λεκτικών μονάδων, αλλά και με επιμέρους τμήματα, που αποτελούν τη βάση της δημιουργίας ενός μεταγλωττιστή (compiler) μιας γλώσσας προγραμματισμού."
      },
      {
        "text": "Το μάθημα διαιρείται στις ακόλουθες ενότητες:"
      },
      {
        "text": "Ενότητα 1: Εισαγωγή στην Μεταγλώττιση."
      },
      {
        "text": "Ενότητα 2: Στοιχεία Θεωρίας Γλωσσών (ορισμός γλωσσών, γραμματικές, αυτόματα, μέσα για τον ορισμό σημασιολογικών προδιαγραφών)."
      },
      {
        "text": "Ενότητα 3: Τρόποι προσδιορισμού σύνταξης (σύνολα, BNF, Συντακτικά διαγράμματα, EBNF)."
      },
      {
        "text": "Ενότητα 4: Λεκτική Ανάλυση (λεκτικός αναλυτής, αναγνώριση λεκτικών μονάδων, κανονικές γραμματικές και κανονικές εκφράσεις, ανάνηψη από λεκτικά λάθη, καθορισμός λεκτικών ομάδων, υλοποίηση λεκτικού αναλυτή, LEX, υλοποίηση λεκτικού αναλυτή)."
      },
      {
        "text": "Ενότητα 5: Συντακτική και Σημασιολογική Ανάλυση (στρατηγικές συντακτικής ανάλυσης, αναλυτές από πάνω προς τα κάτω, αναλυτές από κάτω προς τα πάνω, υλοποίηση συντακτικού αναλυτή, σημασιολογική ανάλυση."
      }
    ],
    "goals": [
      {
        "text": ""
      },
      {
        "text": ""
      },
      {
        "text": ""
      },
      {
        "text": ""
      },
      {
        "text": ""
      }
    ]
  },
  {
    "name": "",
    "code": 1911,
    "description": "",
    "paragraphs": [
      {
        "text": ""
      },
      {
        "text": ""
      },
      {
        "text": ""
      },
      {
        "text": ""
      }
    ],
    "goals": [
      {
        "text": ""
      },
      {
        "text": ""
      },
      {
        "text": ""
      },
      {
        "text": ""
      },
      {
        "text": ""
      }
    ]
  }
]