{
	"name": "Game Developer",	
	"code": 1,
	"softSkills": [
		{
			"text": "Συνεργατικότητα και ομαδικό πνεύμα: Η ικανότητα να εργάζεστε αποτελεσματικά σε ομάδα και να συνεργάζεστε με άλλα μέλη της ομάδας προς επίτευξη κοινών στόχων."
		},
		{
			"text": "Δημιουργικότητα και καινοτομία: Η ικανότητα να σκεφτείτε νέες ιδέες, σχεδιάσετε πρωτότυπα παιχνίδια και να προσφέρετε καινοτόμες λύσεις."
		},
		{
			"text": "Επικοινωνία: Η ικανότητα να επικοινωνείτε αποτελεσματικά με την ομάδα ανάπτυξης και άλλα ενδιαφερόμενα μέρη, να εκφράζετε τις ιδέες σας και να ακούτε και να αξιολογείτε την ανατροφοδότηση."
		},
		{
			"text": "Επίλυση προβλημάτων: Η ικανότητα να ανιχνεύετε προβλήματα και να βρίσκετε αποτελεσματικές λύσεις για αυτά."
		},
		{
			"text": "Οργάνωση και διαχείριση χρόνου: Η ικανότητα να οργανώνετε τις εργασίες σας, να διαχειρίζεστε τον χρόνο σας αποτελεσματικά και να τηρείτε προθεσμίες."
		}
	],
	"hardSkills": [
		{
			"text": "Προγραμματισμός: Γνώση των γλωσσών προγραμματισμού, όπως C, C++, C#, για την ανάπτυξη παιχνιδιών."
		},
		{
			"text": "Σχεδίαση γραφικών και απεικόνιση: Γνώση λογισμικών σχεδίασης γραφικών, όπως Photoshop ή Illustrator, για τη δημιουργία απεικονίσεων και γραφικών στοιχείων του παιχνιδιού."
		},
		{
			"text": "Κινηματογράφηση και αφήγηση: Γνώση των αρχών της κινηματογράφησης, σεναριογραφίας και αφήγησης για τη δημιουργία ενδιαφέρουσας και αρθρωτής ιστορίας στο παιχνίδι."
		},
		{
			"text": "Σχεδίαση ήχου: Γνώση της σχεδίασης ήχου και της χρήσης ήχου στο παιχνίδι για τη δημιουργία εμπειρίας ήχου που ενισχύει την ατμόσφαιρα και την αλληλεπίδραση του παίκτη."
		},
		{
			"text": "Μηχανική μάθηση και τεχνητή νοημοσύνη: Γνώση των αρχών της μηχανικής μάθησης και της τεχνητής νοημοσύνης για τη δημιουργία ευφυών συστημάτων παιχνιδιού."
		}
	],
    "paragraphs": [
		{
			"text": "Η ανάπτυξη παιχνιδιών είναι η διαδικασία δημιουργίας παιχνιδιών για διάφορες πλατφόρμες, όπως υπολογιστές, κονσόλες παιχνιδιών, κινητά τηλέφωνα και άλλες συσκευές. Είναι μια πολυσύνθετη διαδικασία που απαιτεί την εφαρμογή διάφορων δεξιοτήτων και τεχνολογιών για τη δημιουργία ενός απολαυστικού παιχνιδιού. Η διαδικασία ανάπτυξης παιχνιδιών περιλαμβάνει τα εξής:",
			"imageName": ""
		},
		{
			"text": "Σχεδιασμός: Αρχικά, οι προγραμματιστές, οι σχεδιαστές και οι καλλιτέχνες εργάζονται από κοινού για να δημιουργήσουν το σχεδιαστικό στόχο και την ατμόσφαιρα του παιχνιδιού. Αυτό περιλαμβάνει την κατάρτιση ενός σεναρίου, τη σχεδίαση επιπέδων και χαρακτήρων, και την ανάπτυξη της αισθητικής του παιχνιδιού.",
			"imageName": ""
		},
		{
			"text": "Προγραμματισμός: Οι προγραμματιστές δημιουργούν τον κώδικα που επιτρέπει τη λειτουργία του παιχνιδιού. Αυτό περιλαμβάνει τη δημιουργία λειτουργιών παιχνιδιού, την ανίχνευση συγκρούσεων, τον έλεγχο της τεχνητής νοημοσύνης των χαρακτήρων και άλλες τεχνικές πτυχές που εξασφαλίζουν την ομαλή λειτουργία του παιχνιδιού.",
			"imageName": ""
		},
		{
			"text": "Σχεδίαση γραφικών και ήχου: Οι καλλιτέχνες δημιουργούν τα γραφικά στοιχεία του παιχνιδιού, όπως χαρακτήρες, επίπεδα, αντικείμενα και περιβάλλοντα. Επίσης, οι ηχολήπτες δημιουργούν τα ηχητικά εφέ και τη μουσική που θα συνοδεύουν το παιχνίδι, προσδίδοντας την ατμόσφαιρα και την εμβάθυνση της εμπειρίας του παίκτη.",
			"imageName": ""
		},
		{
			"text": "Δοκιμές και αντιμετώπιση προβλημάτων: Κατά τη διάρκεια της ανάπτυξης, πραγματοποιούνται δοκιμές για τον έλεγχο της λειτουργίας, την ανίχνευση σφαλμάτων και την επίλυσή τους. Αυτό εξασφαλίζει την ποιότητα και την αρθρωτή εμπειρία παιχνιδιού.",
			"imageName": ""
		}
    ],
	"requirements": [
		{
			"text": "Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών"
		},
		{
			"text": "Τεχνολογία Λογισμικού"
		},
		{
			"text": "Σύγχρονα Θέματα Τεχνολογίας Λογισμικού"
		},
		{
			"text": "Δομές Δεδομένων και Αλγόριθμοι"
		},
		{
			"text": "Αντικειμενοστρεφής Προγραμματισμός με Java/C#"
		}
	]
}