{
	"name": "Front-end developer",	
	"code": 1,
	"softSkills": [
		{
			"text": "Καλή αισθητική: Ικανότητα να δημιουργείτε ελκυστικές και λειτουργικές διεπαφές χρήστη."
		},
		{
			"text": "Συνεργασία: Ικανότητα να εργάζεστε αποτελεσματικά σε ομάδες και να συνεργάζεστε με σχεδιαστές, προγραμματιστές και άλλα μέλη της ομάδας ανάπτυξης."
		},
		{
			"text": "Επικοινωνία: Ικανότητα να επικοινωνείτε αποτελεσματικά με μη τεχνικούς, να εξηγείτε περίπλοκες έννοιες με απλό τρόπο και να αποκτάτε κατανόηση για τις ανάγκες των χρηστών."
		},
		{
			"text": "Επίλυση προβλημάτων: Ικανότητα ανάλυσης προβλημάτων και εύρεσης λύσεων στις τεχνικές προκλήσεις που μπορεί να προκύψουν κατά τη διάρκεια της ανάπτυξης."
		}
	],
	"hardSkills": [
		{
			"text": "Γλώσσες προγραμματισμού: Κατανόηση και εμπειρία σε γλώσσες όπως HTML, CSS και JavaScript."
		},
		{
			"text": "Τεχνολογίες front-end: Γνώση και εμπειρία με frameworks και βιβλιοθήκες όπως React, Angular, Vue.js, κ.ά."
		},
		{
			"text": "Σχεδίαση διεπαφής χρήστη (UI/UX): Αντίληψη για την αισθητική και την ευχρηστία του σχεδιασμού διεπαφής χρήστη, καθώς και γνώση εργαλείων σχεδίασης όπως το Adobe XD ή το Sketch."
		},
		{
			"text": "Αντίληψη για την απόδοση και τη βελτιστοποίηση: Γνώση τεχνικών για τη βελτιστοποίηση της φόρτωσης της ιστοσελίδας, τη βελτιστοποίηση του κώδικα και τη βελτίωση της επίδοσης."
		}
	],
    "paragraphs": [
		{
			"text": "Οι προγραμματιστές Front-end συνδυάζουν την τεχνική επάρκεια με την αισθητική και την ικανότητα επικοινωνίας για τη δημιουργία ευχάριστων, λειτουργικών και αποδοτικών διεπαφών χρήστη που θα παρέχουν μια εξαιρετική εμπειρία στους χρήστες τους.",
			"imageName": ""
		},
		{
			"text": "Το front-end  αναφέρεται στη δημιουργία του χρήστη φιλικού και ευχάριστου περιβάλλοντος στην οποία αλληλεπιδρά ένας χρήστης με μια ιστοσελίδα ή μια εφαρμογή. Οι προγραμματιστές front-end χρησιμοποιούν γλώσσες προγραμματισμού όπως HTML, CSS και JavaScript για να δημιουργήσουν τη δομή, την εμφάνιση και τη λειτουργικότητα των διαδραστικών στοιχείων που βλέπει ο χρήστης.",
			"imageName": ""
		},
		{
			"text": "Συνολικά, το front end development αποτελεί έναν σημαντικό τομέα της δημιουργίας ιστοσελίδων και εφαρμογών, συνδυάζοντας τεχνικές δεξιότητες προγραμματισμού και αισθητικής σχεδίασης για να παράγει ελκυστικές, λειτουργικές και χρήσιμες διεπαφές για τους χρήστες.",
			"imageName": ""
		}
    ],
	"requirements": [
		{
			"text": "Σύγχρονα Θέματα Τεχνολογίας Λογισμικού"
		},
		{
			"text": "Τεχνολογία Λογισμικού"
		},
		{
			"text": "Αλληλεπίδραση ανθρώπου-υπολογιστή"
		}
	]
}