{
	"name": "UX Designer",	
	"code": 1,
	"softSkills": [
		{
			"text": "Επικοινωνία: Ικανότητα επικοινωνίας με την ομάδα ανάπτυξης και τους πελάτες για την κατανόηση των αναγκών και των απαιτήσεων τους."
		},
		{
			"text": "Ανθρωποκεντρικός προσανατολισμός: Κέντρισμος στον χρήστη και ικανότητα να σκέφτεται από την οπτική του χρήστη προκειμένου να δημιουργήσει μια βέλτιστη εμπειρία χρήστη."
		},
		{
			"text": "Ομαδικότητα: Ικανότητα συνεργασίας με μέλη της ομάδας ανάπτυξης, όπως προγραμματιστές, σχεδιαστές και project managers, για την επίτευξη κοινών στόχων."
		},
		{
			"text": "Κριτική σκέψη: Ικανότητα ανάλυσης και αξιολόγησης των διαδικασιών και των λύσεων UX για την βελτίωση της χρηστικότητας και της απόδοσης."
		},
		{
			"text": "Ευελιξία: Ικανότητα προσαρμογής σε αλλαγές και προκλήσεις κατά τη διάρκεια της διαδικασίας ανάπτυξης."
		}
	],
	"hardSkills": [
		{
			"text": "Σχεδιασμός Διεπαφής Χρήστη (UI Design): Κατανόηση των αρχών σχεδιασμού διεπαφής και ικανότητα δημιουργίας αισθητικών και λειτουργικών διεπαφών."
		},
		{
			"text": "Πρωτότυπα (Prototyping): Ικανότητα δημιουργίας πρωτοτύπων για την αξιολόγηση και την παρουσίαση των σχεδιασμένων λύσεων."
		},
		{
			"text": "Έρευνα Χρήστη (User Research): Ικανότητα συλλογής και ανάλυσης δεδομένων χρήστη για την κατανόηση των αναγκών, συμπεριφοράς και προτιμήσεων του κοινού."
		},
		{
			"text": "Πληροφορική: Γνώση και κατανόηση τεχνολογιών και εργαλείων που συνδέονται με την ανάπτυξη UX, όπως πρωτόκολλα δικτύωσης και περιβάλλοντα ανάπτυξης."
		},
		{
			"text": "Αξιολόγηση Χρήστη (Usability Testing): Ικανότητα πραγματοποίησης δοκιμών χρήστη για την αξιολόγηση της χρηστικότητας και της απόδοσης των διεπαφών."
		}
	],
    "paragraphs": [
		{
			"text": "Το UX Design είναι ο όρος που περιγράφει το design ενός ιστοτόπου σύμφωνα με την εμπειρία του χρήστη, το User eXperience δηλαδή από όπου βγήκε και το όνομά του. ",
			"imageName": ""
		},
		{
			"text": "Πρόκειται για μία έννοια που περιγράφει την εμπειρία που θα αποκομίσει ο επισκέπτης από το website και την αλληλεπίδραση ανάμεσα σε αυτόν και την κάθε σελίδα. Με πιο απλά λόγια, το UX Design σχετίζεται περισσότερο με θέματα δομής, στρατηγικής και λειτουργικότητας παρά με το κομμάτι της εμφάνισης μιας ιστοσελίδας. ",
			"imageName": ""
		},
		{
			"text": "Σύμφωνα με τα παραπάνω, ο UX Designer καλείται να δημιουργήσει ένα ψηφιακό περιβάλλον ιδανικό να καλύψει όλες τις απαιτήσεις των χρηστών / επισκεπτών από άποψη ευχρηστίας και εύκολης περιήγησης. ",
			"imageName": ""
		},
		{
			"text": "Ιδανικά, ο developer που ασχολείται με το UX Design θα πρέπει να δημιουργήσει personas καταναλωτών βάσει των χαρακτηριστικών που έχει το target group κάθε online επιχείρησης.",
			"imageName": ""
		}
    ],
	"requirements": [
		{
			"text": "Αλληλεπίδραση ανθρώπου-υπολογιστή"
		},
		{
			"text": "Σύγχρονα Θέματα Τεχνολογίας Λογισμικού"
		},
		{
			"text": "Αντικειμενοστρεφής Προγραμματισμός με Java/C#"
		}
	]
}